acsh-revenue-tracker/app/controllers/home_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

INSERT INTO "customers" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Customer"], ["last_name", "Name"], ["created_at", "2020-06-02 04:14:27.410698"], ["updated_at", "2020-06-02 04:14:27.410698"]]
SELECT "customers".* FROM "customers" WHERE "customers"."first_name" = $1 AND "customers"."last_name" = $2 LIMIT $3  [["first_name", "Jack"], ["last_name", "Burton"], ["LIMIT", 1]]
INSERT INTO "merchants" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carpenter Outfitters"], ["address", "99 Factory Drive"], ["created_at", "2020-06-02 04:18:47.673936"], ["updated_at", "2020-06-02 04:18:47.673936"]]
SELECT "merchants".* FROM "merchants" WHERE "merchants"."name" = $1 AND "merchants"."address" = $2 LIMIT $3  [["name", "Carpenter Outfitters"], ["address", "99 Factory Drive"], ["LIMIT", 1]]
INSERT INTO "items" ("merchant_id", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["merchant_id", 6], ["description", "Premium Cowboy Boots"], ["price", 149.99], ["created_at", "2020-06-02 04:22:15.789636"], ["updated_at", "2020-06-02 04:22:15.789636"]]
SELECT "items".* FROM "items" WHERE "items"."description" = $1 AND "items"."price" = $2 AND "items"."merchant_id" = $3 LIMIT $4  [["description", "Premium Cowboy Boots"], ["price", 149.99], ["merchant_id", 6], ["LIMIT", 1]]
INSERT INTO "sales" ("customer_id", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["customer_id", 11], ["item_id", 1], ["quantity", 3], ["created_at", "2020-06-02 04:22:15.799703"], ["updated_at", "2020-06-02 04:22:15.799703"]]
SELECT "sales".* FROM "sales" WHERE "sales"."quantity" = $1 AND "sales"."customer_id" = $2 AND "sales"."item_id" = $3 LIMIT $4  [["quantity", 3], ["customer_id", 11], ["item_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "sales"
---
  def uploaded
    file = params[:csv].tempfile
    software_data = Roo::Spreadsheet.open file
    sheet = software_data.sheet(0)
    ActiveRecord::Base.transaction do
      sheet.each do |row|
        next if row[0].blank? || row[0] == 'Customer Name'
        (first_name, last_name) = row[0].split(' ')
        customer = Customer.find_or_create_by(first_name: first_name, last_name: last_name)
        merchant = Merchant.find_or_create_by(name: row[4], address: row[5])
        item = Item.find_or_create_by(description: row[1], price: row[2], merchant: merchant)
        sale = Sale.find_or_create_by(quantity: 3, customer: customer, item: item)
      end
    end
    redirect_to root_path, notice: "There are now #{Sale.count} sales in the database"